app/views/users/_up_event_card.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<div class="w-100 bg-secondary text-light py-2 mt-3 font-weight-bold"><%= link_to 'See Attendees', event %></div>
<div class="w-100 bg-secondary text-light py-2 mt-3 font-weight-bold">Created by: <%= User.find(event.creator_id).username %></div>