app/views/users/show.html.erb

  <% @attendance.each do |attend| %>
    <p><%= Event.find(attend.events_to_attend_id).title %></p>
    <p><%= Event.find(attend.events_to_attend_id).description %></p>
    <p><%= Event.find(attend.events_to_attend_id).time %></p>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]