app/views/home/_event_card.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p><%= event.time %></p>
<div class="w-100 bg-secondary text-light py-2 mt-3 font-weight-bold">Created by: <%= User.find(event.creator_id).username %></div>