app/views/events/show.html.erb

      <% @attendance.each do |attend| %>
        <li class="text-success"><%= User.find(attend.attendee_id).username %></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]