app/helpers/attendances_helper.rb

  def is_attending?(event_id)
    Attendance.where(events_to_attend_id: event_id, attendee_id: current_user.id).any? # check if user is attending the event
---
SELECT  1 AS one FROM "attendances" WHERE "attendances"."events_to_attend_id" = ? AND "attendances"."attendee_id" = ? LIMIT ?  [["events_to_attend_id", 4], ["attendee_id", 1], ["LIMIT", 1]]