app/controllers/attendances_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "attendances" ("events_to_attend_id", "attendee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["events_to_attend_id", 4], ["attendee_id", 1], ["created_at", "2020-07-09 20:16:46.732248"], ["updated_at", "2020-07-09 20:16:46.732248"]]
---
  def create
    @event = Event.find(2)

    @attendance = current_user.attendances.build(events_to_attend_id: @event.id)

    respond_to do |format|
      if @attendance.save