app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def user_attendance(attendance_id)
    User.find(attendance_id).username

SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    # @events = Event.all
    @event = Event.new
    @events = Event.all

INSERT INTO "events" ("title", "description", "time", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = current_user.events.build(event_params)
    @event.creator_id = current_user.id

    respond_to do |format|
      if @event.save

UPDATE "events" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "my first event reloaded"], ["description", "most fun filled event ever made"], ["updated_at", "2020-07-07 15:28:49.277926"], ["id", 2]]
---
  def update
    set_event
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]
---
  def destroy
    set_event
    @event.destroy