app/controllers/events_controller.rb

SELECT "users"."id" FROM "users"
---
  def index
    @events = Event.all
    @event = Event.new
    @Users = User.all